# 10 Minutes to pandas

Some examples taken from [10 Minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)

In [9]:
%pylab inline
import pandas as pd

Populating the interactive namespace from numpy and matplotlib

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [14]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [15]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

# Viewing Data

See the top & bottom rows of the frame

In [17]:
df.head()

                   A         B         C         D
2013-01-01  0.629014  0.743058  0.169506  0.204377
2013-01-02 -0.027784  1.218752 -0.067179  0.438743
2013-01-03  0.966025  0.882615 -1.684298 -0.358047
2013-01-04 -0.950579 -0.067466 -0.693308  0.115328
2013-01-05 -0.523257 -1.172847 -0.873741 -1.147573

In [19]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.332487 -0.505470  1.299883  1.242012
2013-01-05  0.727161  0.034623 -0.860348 -1.576362
2013-01-06  1.553069  1.785129 -0.371540  0.592594

Display the index, columns, and the underlying numpy data

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Describe shows a quick statistic summary of your data

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.593534  0.225632 -0.359363 -0.073117
std    1.071683  1.081109  0.883357  1.227783
min   -1.332487 -0.881380 -1.062095 -1.646069
25%    0.276662 -0.480873 -0.943871 -1.094599
50%    0.922666 -0.186229 -0.615944  0.471641
75%    1.306139  1.004636 -0.235659  0.596975
max    1.553069  1.785129  1.299883  1.242012

Sorting by an axis

In [23]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  0.350689 -1.062095 -0.881380  0.126496
2013-01-02 -1.646069 -0.190366  1.327973  1.118171
2013-01-03  0.598436 -0.971712 -0.407082  1.368795
2013-01-04  1.242012  1.299883 -0.505470 -1.332487
2013-01-05 -1.576362 -0.860348  0.034623  0.727161
2013-01-06  0.592594 -0.371540  1.785129  1.553069

Sorting by values

In [24]:
df.sort_values(by='C')

                   A         B         C         D
2013-01-01  0.126496 -0.881380 -1.062095  0.350689
2013-01-03  1.368795 -0.407082 -0.971712  0.598436
2013-01-05  0.727161  0.034623 -0.860348 -1.576362
2013-01-06  1.553069  1.785129 -0.371540  0.592594
2013-01-02  1.118171  1.327973 -0.190366 -1.646069
2013-01-04 -1.332487 -0.505470  1.299883  1.242012

## Selection

While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, **.at**, **.iat**, **.loc**,
**.iloc** and **.ix**

### Getting
Selecting a single column, which yields a Series, equivalent to df.A

In [25]:
df['A']

2013-01-01    0.126496
2013-01-02    1.118171
2013-01-03    1.368795
2013-01-04   -1.332487
2013-01-05    0.727161
2013-01-06    1.553069
Freq: D, Name: A, dtype: float64

In [26]:
df.A

2013-01-01    0.126496
2013-01-02    1.118171
2013-01-03    1.368795
2013-01-04   -1.332487
2013-01-05    0.727161
2013-01-06    1.553069
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [27]:
df[0:3]

                   A         B         C         D
2013-01-01  0.126496 -0.881380 -1.062095  0.350689
2013-01-02  1.118171  1.327973 -0.190366 -1.646069
2013-01-03  1.368795 -0.407082 -0.971712  0.598436

In [28]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.118171  1.327973 -0.190366 -1.646069
2013-01-03  1.368795 -0.407082 -0.971712  0.598436
2013-01-04 -1.332487 -0.505470  1.299883  1.242012

### Selection by Label

For getting a cross section using a label

In [29]:
df.loc[dates[0]]

A    0.126496
B   -0.881380
C   -1.062095
D    0.350689
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [30]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.126496 -0.881380
2013-01-02  1.118171  1.327973
2013-01-03  1.368795 -0.407082
2013-01-04 -1.332487 -0.505470
2013-01-05  0.727161  0.034623
2013-01-06  1.553069  1.785129

Showing label slicing, both endpoints are included

In [31]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.118171  1.327973
2013-01-03  1.368795 -0.407082
2013-01-04 -1.332487 -0.505470

In [32]:
df.loc['20130102',['A','B']]

A    1.118171
B    1.327973
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [36]:
df.loc[dates[0],'A'] 
#Purely label-location based indexer for selection by label.

0.12649601537493685

For getting fast access to a scalar (equiv to the prior method)

In [38]:
df.at[dates[0],'A']
#Fast label-based scalar accessor

0.12649601537493685

### Selection by Position

Select via the position of the passed integers

In [39]:
df.iloc[3]

A   -1.332487
B   -0.505470
C    1.299883
D    1.242012
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

In [42]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.332487 -0.505470
2013-01-05  0.727161  0.034623

For getting a value explicitly

In [44]:
df.iloc[1,1]

1.3279732362343299

In [47]:
df.iat[1,1]
#Fast integer location scalar accessor.

#Similarly to ``iloc``, ``iat`` provides **integer** based lookups.
#You can also set using these indexers.

1.3279732362343299

### Boolean Indexing
Using a single columnâ€™s values to select data.

In [48]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.126496 -0.881380 -1.062095  0.350689
2013-01-02  1.118171  1.327973 -0.190366 -1.646069
2013-01-03  1.368795 -0.407082 -0.971712  0.598436
2013-01-05  0.727161  0.034623 -0.860348 -1.576362
2013-01-06  1.553069  1.785129 -0.371540  0.592594

Selecting values from a DataFrame where a boolean condition is met.

In [49]:
df[df>0]

                   A         B         C         D
2013-01-01  0.126496       NaN       NaN  0.350689
2013-01-02  1.118171  1.327973       NaN       NaN
2013-01-03  1.368795       NaN       NaN  0.598436
2013-01-04       NaN       NaN  1.299883  1.242012
2013-01-05  0.727161  0.034623       NaN       NaN
2013-01-06  1.553069  1.785129       NaN  0.592594

Using the isin() method for filtering:

In [51]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.126496 -0.881380 -1.062095  0.350689    one
2013-01-02  1.118171  1.327973 -0.190366 -1.646069    one
2013-01-03  1.368795 -0.407082 -0.971712  0.598436    two
2013-01-04 -1.332487 -0.505470  1.299883  1.242012  three
2013-01-05  0.727161  0.034623 -0.860348 -1.576362   four
2013-01-06  1.553069  1.785129 -0.371540  0.592594  three

In [52]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.368795 -0.407082 -0.971712  0.598436   two
2013-01-05  0.727161  0.034623 -0.860348 -1.576362  four

### Setting
Setting a new column automatically aligns the data by the indexes

In [53]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [54]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.126496 -0.881380 -1.062095  0.350689  NaN
2013-01-02  1.118171  1.327973 -0.190366 -1.646069  1.0
2013-01-03  1.368795 -0.407082 -0.971712  0.598436  2.0
2013-01-04 -1.332487 -0.505470  1.299883  1.242012  3.0
2013-01-05  0.727161  0.034623 -0.860348 -1.576362  4.0
2013-01-06  1.553069  1.785129 -0.371540  0.592594  5.0

Setting values by label

In [55]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.881380 -1.062095  0.350689  NaN
2013-01-02  1.118171  1.327973 -0.190366 -1.646069  1.0
2013-01-03  1.368795 -0.407082 -0.971712  0.598436  2.0
2013-01-04 -1.332487 -0.505470  1.299883  1.242012  3.0
2013-01-05  0.727161  0.034623 -0.860348 -1.576362  4.0
2013-01-06  1.553069  1.785129 -0.371540  0.592594  5.0

Setting values by position

In [57]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.062095  0.350689  NaN
2013-01-02  1.118171  1.327973 -0.190366 -1.646069  1.0
2013-01-03  1.368795 -0.407082 -0.971712  0.598436  2.0
2013-01-04 -1.332487 -0.505470  1.299883  1.242012  3.0
2013-01-05  0.727161  0.034623 -0.860348 -1.576362  4.0
2013-01-06  1.553069  1.785129 -0.371540  0.592594  5.0

Setting by assigning with a numpy array

In [58]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.062095  5  NaN
2013-01-02  1.118171  1.327973 -0.190366  5  1.0
2013-01-03  1.368795 -0.407082 -0.971712  5  2.0
2013-01-04 -1.332487 -0.505470  1.299883  5  3.0
2013-01-05  0.727161  0.034623 -0.860348  5  4.0
2013-01-06  1.553069  1.785129 -0.371540  5  5.0

A where operation with setting.

In [59]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.062095 -5  NaN
2013-01-02 -1.118171 -1.327973 -0.190366 -5 -1.0
2013-01-03 -1.368795 -0.407082 -0.971712 -5 -2.0
2013-01-04 -1.332487 -0.505470 -1.299883 -5 -3.0
2013-01-05 -0.727161 -0.034623 -0.860348 -5 -4.0
2013-01-06 -1.553069 -1.785129 -0.371540 -5 -5.0

## Missing Data
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. 
Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [64]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1
#Conform DataFrame to new index with optional filling logic, placing
#NA/NaN in locations having no value in the previous index. A new object
#is produced unless the new index is equivalent to the current one and
#copy=False

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.062095  5  NaN  1.0
2013-01-02  1.118171  1.327973 -0.190366  5  1.0  1.0
2013-01-03  1.368795 -0.407082 -0.971712  5  2.0  NaN
2013-01-04 -1.332487 -0.505470  1.299883  5  3.0  NaN

To drop any rows that have missing data.

In [62]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.118171  1.327973 -0.190366  5  1.0  1.0

Filling missing data

In [65]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.062095  5  5.0  1.0
2013-01-02  1.118171  1.327973 -0.190366  5  1.0  1.0
2013-01-03  1.368795 -0.407082 -0.971712  5  2.0  5.0
2013-01-04 -1.332487 -0.505470  1.299883  5  3.0  5.0

To get the boolean mask where values are nan

In [69]:
df1.isnull()

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Exercise

Read and try the rest of [10 Minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)